results-homelab-colocated/output_homelab_colocate_3vm_gemfire_macbook-10000_1t_load.txt
/Library/Java/JavaVirtualMachines/adoptopenjdk-8.jdk/Contents/Home/bin/java  -classpath /Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/conf:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/core/target/core-0.18.0-SNAPSHOT.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/core/target/dependency/HdrHistogram-2.1.4.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/core/target/dependency/jackson-core-asl-1.9.4.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/geode-binding-0.18.0-SNAPSHOT.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/HdrHistogram-2.1.4.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/LatencyUtils-2.0.3.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/antlr-2.7.7.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/bson-4.8.1.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/classgraph-4.8.154.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/commons-beanutils-1.9.4.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/commons-codec-1.11.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/commons-collections-3.2.2.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/commons-digester-2.1.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/commons-io-2.11.0.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/commons-lang3-3.12.0.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/commons-logging-1.2.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/commons-validator-1.7.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/fastutil-8.5.11.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/gemfire-common-10.0.4.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/gemfire-core-10.0.4.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/gemfire-deployment-chained-classloader-10.0.4.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/gemfire-logging-10.0.4.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/gemfire-management-10.0.4.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/gemfire-membership-10.0.4.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/gemfire-serialization-10.0.4.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/gemfire-tcp-messenger-10.0.4.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/gemfire-tcp-server-10.0.4.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/gemfire-unsafe-10.0.4.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/gemfire-version-10.0.4.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/httpclient-4.5.14.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/httpcore-4.4.16.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/istack-commons-runtime-4.0.1.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/jackson-annotations-2.16.1.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/jackson-core-2.16.1.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/jackson-databind-2.16.1.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/jackson-datatype-joda-2.16.1.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/jackson-datatype-jsr310-2.16.1.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/javax.activation-api-1.2.0.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/javax.resource-api-1.7.1.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/javax.transaction-api-1.3.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/jaxb-api-2.3.1.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/jaxb-impl-2.3.2.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/jgroups-3.6.14.Final.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/jna-5.12.1.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/jna-platform-5.12.1.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/joda-time-2.10.14.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/jopt-simple-5.0.4.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/log4j-api-2.19.0.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/micrometer-commons-1.10.2.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/micrometer-core-1.10.2.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/micrometer-observation-1.10.2.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/netty-buffer-4.1.108.Final.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/netty-codec-4.1.108.Final.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/netty-common-4.1.108.Final.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/netty-handler-4.1.108.Final.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/netty-resolver-4.1.108.Final.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/netty-transport-4.1.108.Final.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/netty-transport-native-unix-common-4.1.108.Final.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/rmiio-2.1.2.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/shiro-cache-1.13.0.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/shiro-config-core-1.13.0.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/shiro-config-ogdl-1.13.0.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/shiro-core-1.13.0.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/shiro-crypto-cipher-1.13.0.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/shiro-crypto-core-1.13.0.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/shiro-crypto-hash-1.13.0.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/shiro-event-1.13.0.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/shiro-lang-1.13.0.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/slf4j-api-1.7.25.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/spring-beans-5.3.34.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/spring-core-5.3.34.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/spring-jcl-5.3.34.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/spring-web-5.3.34.jar site.ycsb.Client -load -db site.ycsb.db.GeodeClient -P ../YCSB-geode-custom/workloads/workloada -p geode.locator=192.168.0.78[55221] -P ./ycsb.config -P ./gemfire.config -s
Command line: -load -db site.ycsb.db.GeodeClient -P ../YCSB-geode-custom/workloads/workloada -p geode.locator=192.168.0.78[55221] -P ./ycsb.config -P ./gemfire.config -s
[INFO] recordcount:10000
[INFO] threadcount:1
[INFO] operationcount:10000
[INFO] readproportion:0.5
[INFO] updateproportion:0.5
YCSB Client 0.18.0-SNAPSHOT

Loading workload...
Starting test.
2024-04-20 23:35:06:273 0 sec: 0 operations; est completion in 0 second 
ERROR StatusLogger Log4j2 could not find a logging implementation. Please add log4j-core to the classpath. Using SimpleLogger to log to the console...
[DEBUG] GeodeClient.java addPoolLocator:4c5fec0a-a29e-461a-a8a4-c9c6af900194.locator-server.network.service-instance-1d8cf652-27f5-4220-a04f-1cadb69b08fe.bosh:55221
SLF4J: Failed to load class "org.slf4j.impl.StaticLoggerBinder".
SLF4J: Defaulting to no-operation (NOP) logger implementation
SLF4J: See http://www.slf4j.org/codes.html#StaticLoggerBinder for further details.
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
## UserPasswordAuthInit security-username:cluster_operator_kSZXA6unTmdKT3slnH5EJg
## UserPasswordAuthInit security-username:cluster_operator_kSZXA6unTmdKT3slnH5EJg
## UserPasswordAuthInit security-username:cluster_operator_kSZXA6unTmdKT3slnH5EJg
2024-04-20 23:35:16:253 10 sec: 1076 operations; 107.52 current ops/sec; est completion in 1 minute [INSERT: Count=1077, Max=882687, Min=2764, Avg=7825.61, 90=11671, 99=25167, 99.9=118847, 99.99=882687] 
2024-04-20 23:35:26:249 20 sec: 2981 operations; 190.6 current ops/sec; est completion in 48 seconds [INSERT: Count=1905, Max=111615, Min=2540, Avg=5177.95, 90=7203, 99=21631, 99.9=33343, 99.99=111615] 
2024-04-20 23:35:36:249 30 sec: 5129 operations; 214.71 current ops/sec; est completion in 29 seconds [INSERT: Count=2148, Max=37599, Min=2656, Avg=4601.11, 90=6235, 99=10839, 99.9=18831, 99.99=37599] 
2024-04-20 23:35:46:251 40 sec: 7285 operations; 215.62 current ops/sec; est completion in 15 seconds [INSERT: Count=2156, Max=109631, Min=2442, Avg=4592.48, 90=6127, 99=11047, 99.9=24239, 99.99=109631] 
2024-04-20 23:35:56:250 50 sec: 9431 operations; 214.56 current ops/sec; est completion in 4 second [INSERT: Count=2145, Max=56255, Min=2298, Avg=4641.19, 90=6463, 99=11007, 99.9=35967, 99.99=56255] 
2024-04-20 23:35:58:953 52 sec: 10000 operations; 210.43 current ops/sec; [CLEANUP: Count=1, Max=9, Min=9, Avg=9, 90=9, 99=9, 99.9=9, 99.99=9] [INSERT: Count=569, Max=20191, Min=2426, Avg=4711.39, 90=6715, 99=11775, 99.9=16135, 99.99=20191] 
[OVERALL], RunTime(ms), 52711
[OVERALL], Throughput(ops/sec), 189.7137219935118
[TOTAL_GCS_PS_Scavenge], Count, 2
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 41
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.07778262601733983
[TOTAL_GCS_PS_MarkSweep], Count, 1
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 18
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.03414846995883212
[TOTAL_GCs], Count, 3
[TOTAL_GC_TIME], Time(ms), 59
[TOTAL_GC_TIME_%], Time(%), 0.11193109597617196
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 9.0
[CLEANUP], MinLatency(us), 9
[CLEANUP], MaxLatency(us), 9
[CLEANUP], 95thPercentileLatency(us), 9
[CLEANUP], 99thPercentileLatency(us), 9
[INSERT], Operations, 10000
[INSERT], AverageLatency(us), 5071.2883
[INSERT], MinLatency(us), 2298
[INSERT], MaxLatency(us), 882687
[INSERT], 95thPercentileLatency(us), 8999
[INSERT], 99thPercentileLatency(us), 16431
[INSERT], Return=OK, 10000